Tekla Open API Reference for Tekla Structures 2025
Operation.ConvertPartToItem Method
 Convert a part to an item. This will also create a new shape in the shape catalog.
 Namespace: Tekla.Structures.Model.Operations
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool ConvertPartToItem(
	 in Part originalPart,
	out Brep newItem
)
Public Shared Function ConvertPartToItem (
	 ByRef originalPart As Part,
	<OutAttribute> ByRef newItem As Brep
) As Boolean
Parameters
originalPart
Type: Tekla.Structures.Model.Part
Original part
newItem
Type: Tekla.Structures.Model.Brep
Newly created item
Return Value
Type: Boolean
True on success, false on failure.
Exceptions
Exception | Condition
ArgumentNullException | Thrown if the originalPart is null.
See Also
Reference
Operation Class
Tekla.Structures.Model.Operations Namespace